# CannotCopyMullionsWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyMullionsWarn Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Mullions and panels cannot be copied without copying the entire curtain wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyMullionsWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyMullionsWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyMullionsWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace